import * as Yup from "yup";

export const SignUpSchema = Yup.object().shape({
  email: Yup.string()
    .email("Некоректна електронна пошта")
    .required("Будь-ласка введіть вашу адресу електронної пошти")
    .matches(
      /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/,
      "Неправильний формат електронної пошти"
    ),
  password: Yup.string()
    .trim()
    .required("Будь-ласка введіть пароль")
    .min(6, "Пароль надто короткий")
    .max(16, "Пароль не може бути довшим за 16 символів"),
});

export const LoginSchema = Yup.object().shape({
  email: Yup.string()
    .email("Некоректна електронна пошта")
    .required("Будь-ласка введіть вашу адресу електронної пошти"),
  password: Yup.string()
    .trim()
    .required("Будь-ласка введіть пароль")
    .min(6, "Ваш пароль надто короткий")
    .max(16, "Пароль не може бути довшим за 16 символів"),
});

// name: Yup.string()
//     .required("Будь-ласка введіть ваше ім'я")
//     .matches(/^[a-zA-Z0-9]+$/, "Спеціальні символи не допускаються")
//     .min(3, "Ім'я не може бути менше трьох символів ")
//     .max(15, "Ім'я не може бути довшим за 15 символів"),
